## Pandas
 * Series
 * DataFrame

In [3]:
# Series
import pandera as pa
import pandas as pd

data: pd.Series = pd.Series([1, 2, 3, 4, 5])
print(data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
values: list[int] = [1, 2, 3, 4, 5]
ind: list[list[str]] = [["a1", "a1", "a2", "a2", "a3"],
                        ["a", "b", "c", "d", "e"]]

data: pd.Series = pd.Series(values, index=ind)
print(data)

a1  a    1
    b    2
a2  c    3
    d    4
a3  e    5
dtype: int64

In [21]:
# DataFrame 

import pandera as pa
import pandas as pd

df: pd.DataFrame = pd.DataFrame([[1, 2, 3, 4, 5],[6, 7, 8, 9, 10],[11, 12, 13, 14, 15]], index=[1, 2, 3], columns=["a", "b", "c", "d", "e"],)
print(df)

id: pd.Series = pd.Series([1, 2, 3, 4, 5], name="Student_id")
score: pd.Series = pd.Series([90, 80, 70, 60, 50], name="Score")
name: pd.Series = pd.Series(["Hijabie", "Ahsaan", "Abbasi", "Gossipie", "Alizay"], name="Name")

# dfe: pd.DataFrame = pd.DataFrame({"Student_id": id, "Score": score, "Name": name})
# print(dfe)

dfe: pd.DataFrame = pd.concat([id,score,name],axis=1)
dfe

    a   b   c   d   e
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15

   Student_id  Score      Name
0           1     90   Hijabie
1           2     80    Ahsaan
2           3     70    Abbasi
3           4     60  Gossipie
4           5     50    Alizay

In [26]:
import numpy as np
from nptyping import NDArray,Shape, Int64

data: NDArray[Shape["10, 10"], Int64] = np.arange(10*10).reshape(10,10)

df: pd.DataFrame = pd.DataFrame(data, columns=list("ABCDEFGHIJ"), index=list("KLMNOPQRST"))
df

    A   B   C   D   E   F   G   H   I   J
K   0   1   2   3   4   5   6   7   8   9
L  10  11  12  13  14  15  16  17  18  19
M  20  21  22  23  24  25  26  27  28  29
N  30  31  32  33  34  35  36  37  38  39
O  40  41  42  43  44  45  46  47  48  49
P  50  51  52  53  54  55  56  57  58  59
Q  60  61  62  63  64  65  66  67  68  69
R  70  71  72  73  74  75  76  77  78  79
S  80  81  82  83  84  85  86  87  88  89
T  90  91  92  93  94  95  96  97  98  99

In [30]:
df: list[pd.DataFrame] = pd.read_html("https://www.w3schools.com/python/python_operators.asp")
df[1]

   Operator  Example     Same As    Try it
0         =    x = 5       x = 5  Try it »
1        +=   x += 3   x = x + 3  Try it »
2        -=   x -= 3   x = x - 3  Try it »
3        *=   x *= 3   x = x * 3  Try it »
4        /=   x /= 3   x = x / 3  Try it »
5        %=   x %= 3   x = x % 3  Try it »
6       //=  x //= 3  x = x // 3  Try it »
7       **=  x **= 3  x = x ** 3  Try it »
8        &=   x &= 3   x = x & 3  Try it »
9        |=   x |= 3   x = x | 3  Try it »
10       ^=   x ^= 3   x = x ^ 3  Try it »
11      >>=  x >>= 3  x = x >> 3  Try it »
12      <<=  x <<= 3  x = x << 3  Try it »

In [31]:
df: pd.DataFrame = pd.read_json("https://www.w3schools.com/python/pandas/data.js")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [52]:
data: pd.DataFrame = pd.DataFrame({
    "column1": [1, 2, 3, 4, 5],
    "column2": [5.0, 6.6, 6.5, 8.1, 10.0],
}, index=["row1", "row2", "row3", "row4", "row5"])

schema = pa.DataFrameSchema({
    "column1": pa.Column(int, checks=pa.Check.le(10)),
    "column2": pa.Column(float, checks=pa.Check.lt(40)),
})

validated_df = schema(data)
print(validated_df)

      column1  column2
row1        1      5.0
row2        2      6.6
row3        3      6.5
row4        4      8.1
row5        5     10.0

## Slicing and Indexing Data

In [67]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5],index=["a","b","c","d","e"] )
s1[0:3]

s1.iloc[0:3]
s1.loc["a":"d"]
s1.iat[1]
s1.at["e"]

5

In [79]:
import re
import pandas as pd

grades = """
Mubeen: PIAIC-394944
Hammad: PIAIC 394943
Muhammad: PIAIC-394942
Hijabie: PIAIC-394945
"""

patterns = r"([A-Z][a-z]+): (PIAIC-? ?\d{5,6})"  # Using raw string (r"") to avoid escaping issues

data = re.findall(patterns, grades)

df = pd.DataFrame(data, columns=["Name", "ID"])
df

       Name            ID
0    Mubeen  PIAIC-394944
1    Hammad  PIAIC 394943
2  Muhammad  PIAIC-394942
3   Hijabie  PIAIC-394945

In [88]:
# DataFrame: employees
# +-------------+--------+
# | Column Name | Type   |
# +-------------+--------+
# | employee_id | int    |
# | name        | object |
# | department  | object |
# | salary      | int    |
# +-------------+--------+
# Write a solution to display the first 3 rows of this DataFrame.


def selectFirstRows(employees: pd.DataFrame) -> pd.DataFrame:
    employee: pd.DataFrame = pd.DataFrame(employees)
    return employee.head(3)

employees: pd.DataFrame = pd.DataFrame({
    "employee_id": [3, 90, 9, 60, 49, 43,],
    "name": ["Bob", "Alice", "Tatiana", "Annabelle", "Jonathan", "Khaled"],
    "department": ["Operations", "Sales", "Engineering", "InformationTechnology", "HumanResources", "Administration"],
    "salary": [48675, 11096, 33805, 37678, 23793, 40454],
})

selectFirstRows(employees)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

In [98]:
id: pd.Series = pd.Series([1, 2, 3, 4, 5], name="Student_id")
score: pd.Series = pd.Series([90, 80, 70, 60, 50], name="Score")
name: pd.Series = pd.Series(["Hijabie", "Ahsaan", "Abbasi", "Gossipie", "Alizay"], name="Name")

dfe: pd.DataFrame = pd.DataFrame({"Student_id": id, "Score": score, "Name": name})
# Assuming row indexing starts from 0
score_of_row_2 = dfe.loc[2, 'Score']
print("Score of row 2:", score_of_row_2)

# Slice multiple rows and only the 'Score' column
scores_of_rows_2_to_4 = dfe.loc[2:4, 'Score']
print("Scores of rows 2 to 4:")
print(scores_of_rows_2_to_4)

# Slice multiple rows and Select Multiple column
scores_of_rows_2_to_4 = dfe.loc[2:4, ['Score', 'Name']]
print("Scores of rows 2 to 4:")
print(scores_of_rows_2_to_4)

Score of row 2: 70
Scores of rows 2 to 4:
2    70
3    60
4    50
Name: Score, dtype: int64
Scores of rows 2 to 4:
   Score      Name
2     70    Abbasi
3     60  Gossipie
4     50    Alizay

In [99]:
# DataFrame players:
# +-------------+--------+
# | Column Name | Type   |
# +-------------+--------+
# | player_id   | int    |
# | name        | object |
# | age         | int    |
# | position    | object |
# | ...         | ...    |
# +-------------+--------+
# Write a solution to calculate and display the number of rows and columns of players.

# Return the result as an array:

# [number of rows, number of columns]
import pandas as pd

def getDataframeSize(players: pd.DataFrame) -> list[int]:
    dplayer: pd.DataFrame = pd.DataFrame(players)
    return [dplayer.shape[0], dplayer.shape[1]]

players: pd.DataFrame = pd.DataFrame({
    "player_id": [1, 2, 3, 4, 5,],
    "name": ["Hijabie", "Ahsaan", "Abbasi", "Gossipie", "Alizay"],
    "age": [22, 23, 24, 25, 26],
    "position": ["GK", "GK", "GK", "GK", "GK"],
    "club": ["Liverpool", "Liverpool", "Liverpool", "Liverpool", "Liverpool"],
})

getDataframeSize(players)

[5, 5]